<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="10" name="x" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="x">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="x_lengths" type="Parameter" version="opset1">
			<data shape="?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="x_lengths">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sid" type="Parameter" version="opset1">
			<data shape="?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="sid">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="tone" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="tone">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="language" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="language">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="bert" type="Parameter" version="opset1">
			<data shape="?,1024,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="bert">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="ja_bert" type="Parameter" version="opset1">
			<data shape="?,768,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="ja_bert">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="noise_scale" type="Parameter" version="opset1">
			<data shape="" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="noise_scale" />
			</output>
		</layer>
		<layer id="2" name="length_scale" type="Parameter" version="opset1">
			<data shape="" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="length_scale" />
			</output>
		</layer>
		<layer id="1" name="noise_scale_w" type="Parameter" version="opset1">
			<data shape="" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="noise_scale_w" />
			</output>
		</layer>
		<layer id="0" name="sdp_ratio" type="Parameter" version="opset1">
			<data shape="" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="sdp_ratio" />
			</output>
		</layer>
		<layer id="11" name="aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="12" name="__module.model.enc_p/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="13" name="self.model.enc_p.emb.weight" type="Const" version="opset1">
			<data element_type="u8" shape="219, 192" offset="4" size="42048" />
			<output>
				<port id="0" precision="U8">
					<dim>219</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Convert_995653" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>219</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>219</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="self.model.enc_p.emb.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="219, 1" offset="42052" size="219" />
			<output>
				<port id="0" precision="U8">
					<dim>219</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Convert_995656" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>219</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>219</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="self.model.enc_p.emb.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>219</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>219</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>219</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.enc_p.emb.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="219, 1" offset="42271" size="438" />
			<output>
				<port id="0" precision="FP16">
					<dim>219</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="self.model.enc_p.emb.weight/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>219</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>219</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>219</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.model.enc_p.emb.weight/fq_weights_0/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>219</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>219</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.enc_p.emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.model.enc_p.emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="23" name="__module.model.enc_p.emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>219</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="249">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.enc_p.tone_emb.weight" type="Const" version="opset1">
			<data element_type="u8" shape="16, 192" offset="42709" size="3072" />
			<output>
				<port id="0" precision="U8">
					<dim>16</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Convert_1442206" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>16</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="self.model.enc_p.tone_emb.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="16, 1" offset="45781" size="16" />
			<output>
				<port id="0" precision="U8">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Convert_1442209" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="self.model.enc_p.tone_emb.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="self.model.enc_p.tone_emb.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1" offset="45797" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="self.model.enc_p.tone_emb.weight/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>16</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="self.model.enc_p.tone_emb.weight/fq_weights_0/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.enc_p.tone_emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.enc_p.tone_emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="__module.model.enc_p.tone_emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="251">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.model.enc_p/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="252">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="self.model.enc_p.language_emb.weight" type="Const" version="opset1">
			<data element_type="u8" shape="8, 192" offset="45829" size="1536" />
			<output>
				<port id="0" precision="U8">
					<dim>8</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Convert_1442415" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>8</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="self.model.enc_p.language_emb.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="8, 1" offset="47365" size="8" />
			<output>
				<port id="0" precision="U8">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Convert_1442418" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="self.model.enc_p.language_emb.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.model.enc_p.language_emb.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="8, 1" offset="47373" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="self.model.enc_p.language_emb.weight/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="self.model.enc_p.language_emb.weight/fq_weights_0/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.enc_p.language_emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.enc_p.language_emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="46" name="__module.model.enc_p.language_emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="254">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.enc_p/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="255">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="self.model.enc_p.bert_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="192, 1024, 1" offset="47389" size="196608" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convert_820413" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="self.model.enc_p.bert_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="192, 1, 1" offset="243997" size="192" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Convert_820416" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="self.model.enc_p.bert_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="self.model.enc_p.bert_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1, 1" offset="244189" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="self.model.enc_p.bert_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="self.model.enc_p.bert_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.model.enc_p.bert_proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.model.enc_p.bert_proj/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="244573" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.enc_p.bert_proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="238">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.enc_p/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="245341" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.enc_p/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="239,bert_emb">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.enc_p/aten::add/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="256">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="self.model.enc_p.ja_bert_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="192, 768, 1" offset="245353" size="147456" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Convert_876217" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="self.model.enc_p.ja_bert_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="192, 1, 1" offset="392809" size="192" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Convert_876220" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="self.model.enc_p.ja_bert_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="self.model.enc_p.ja_bert_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1, 1" offset="393001" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="self.model.enc_p.ja_bert_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="self.model.enc_p.ja_bert_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="393385" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="246">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.enc_p/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="245341" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.enc_p/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="247,ja_bert_emb">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.enc_p/aten::add/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="257">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_556871" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="394153" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.enc_p/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="258,x.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.enc_p/aten::transpose/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="245341" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.enc_p/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="259,x.5">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="ShapeOf_581427" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_581428" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="394157" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="82" name="Constant_581429" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="394165" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="83" name="Gather_581430" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="260" />
			</output>
		</layer>
		<layer id="84" name="__module.model.enc_p/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="394173" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="85" name="__module.model.enc_p/aten::arange/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="261,x.7">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="222" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="394165" size="8" />
			<output>
				<port id="0" precision="I64" names="222" />
			</output>
		</layer>
		<layer id="87" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="262">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="221" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="394177" size="8" />
			<output>
				<port id="0" precision="I64" names="221" />
			</output>
		</layer>
		<layer id="89" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="263">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.enc_p/aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="264">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="265">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.enc_p/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="266,29,x_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="77" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="394157" size="8" />
			<output>
				<port id="0" precision="I64" names="77" />
			</output>
		</layer>
		<layer id="94" name="aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="317,78">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="96" name="__module.model.enc_p/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="267,x.9">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.model.enc_p.encoder/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="320,input.1">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="219" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="394185" size="8" />
			<output>
				<port id="0" precision="I64" names="219" />
			</output>
		</layer>
		<layer id="99" name="__module.model.enc_p.encoder/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="318">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.enc_p.encoder/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="319,mask.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_556872" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.model.enc_p.encoder.attn_layers.0/aten::eq/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="1152,1336,409,593,784,968">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.enc_p.encoder.attn_layers.0/aten::masked_fill/ConvertLike" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="394193" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="104" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight" type="Const" version="opset1">
			<data element_type="u8" shape="192, 192, 1" offset="394197" size="36864" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Convert_999639" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="192, 1, 1" offset="431061" size="192" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Convert_999642" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1, 1" offset="431253" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="self.model.enc_p.encoder.attn_layers.0.conv_q.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="431637" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="333,query.1">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_582660" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="432405" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.enc_p.encoder.attn_layers.0/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="354">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.enc_p.encoder.attn_layers.0/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="432437" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.model.enc_p.encoder.attn_layers.0/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355,query.3">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_556873" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="432453" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="362,376,x.11">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight" type="Const" version="opset1">
			<data element_type="u8" shape="192, 192, 1" offset="432457" size="36864" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Convert_1003625" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="192, 1, 1" offset="469321" size="192" />
			<output>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Convert_1003628" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1, 1" offset="469513" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="self.model.enc_p.encoder.attn_layers.0.conv_k.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="469897" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="340,key.1">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Constant_582661" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="432405" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="__module.model.enc_p.encoder.attn_layers.0/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
